/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: 
1. console.log ค่า มันจะขึ้นมาเลย เช่นอยากได้ ผลลัพแบบ 20 ผลเพื่อดู console.log(เนื้อหา(ปีกย่อยของเนื้อหา 1 )); 
ถึง console.log(เนื้อหา(ปีกย่อยของเนื้อหา 20 )); มันจะโชวย์เลย
2. มันตั้งค่าสูตรแยกจะเนื้อหาของที่เราจะไม่ไปยุ่ง คือมี ข้อมูล 1 ก้อนที่เราจะไม่ไปยุ่ง(เนื้อหางานที่เราจับแก้ไม่ได้ เราต้องสร้างอีกก้อนมาเพื่อเพิ่มข้อมูลแล้วดึงมาใช้ 
3. ของเสริมที่น่าเอามาใช้ในตัว callback เพื่อชีวิตโค้ดที่สะดวกขึ้น เช่นพวก .map .join เพื่อสะดวก และรวดเร็ว


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer: คิดว่าอ่านยากขึ้น เพราะ ตัวแปรจะเยอะ เหมือนเอา โฟลเดอร์ ใส่ โฟลเดอร์ แปลงข้อมูล ไฟล์ 2 - 3 ค่า 
        แต่ขอดีคือ จัดระเบียบแล้ว  = ดูง่ายขึ้น ยากแค่ทำครั้งแรก แต่พอทำแล้วจะดูสะดวกขึ้น 


3. หากต้องสอนเพื่อนให้เข้าใจ Callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  เหตุผลที่ 1 มันคือ google ที่มี extensions คือของเสริมในระบบ google หรือว่า callback เยอะ เช่นการแปลภาษาใน google ถ้าไม่มี extensions = ก็อป นำไปแปลเองทีละประโยค 
แต่ถ้ามี extensions คลิกปุ่มที่โหลดเสริมว่าแปล = แปลเลย แค่ช่วงฝึกติดตั้ง มันจะดูยุ่งยากเฉย ๆ เหมือน callback ที่ต้อง Functiong เยอะนิดนึง แต่ถ้าใช้ของเสริมอย่าง .map มันใส่ค่าได้เลยแบบทั้งหมด 
         เหตุผลที่ 2 มันคือตัวช่วยแปลภาษาใน youtube มันมีซับให้แต่มันจะมีแปลจากอิง เป็น ไทย ให้เอง ซึ่งดี แต่มันจะมี extensions เสริมอย่าง Glasp(ตัวช่วยเสริมคล้าย ๆ callback)
         แค่กดด้านข้างคลิกที่รูป GPT = เข้าหน้า Ai แปลให้ได้เลย + สรุปให้ด้วยนั้นคือ callback ใน Function


*/
